'''
Что можно приготовить из имеющихся продуктов.
'''




recipes = {
    "Блины": {

        "молоко": 500,
        "яйца": 3,
        "мука": 200,
        "масло сливочное (или растительное)": 30,
        "сахар": 2,
        "соль": 0.5

    },

    "Яичница": {
        "яйца": 2,
        "масло сливочное (или растительное)": 10
        }

}

fridge = {

        "молоко": 600,
        "яйца": 10,
        "мука": 250,
        "масло сливочное (или растительное)": 1000,
        "сахар": 2000,
        "соль": 200

}

result = []

for name, recipe in recipes.items():

    is_valid = True
    for i in recipe:
        if not fridge[i] >= recipe[i]:
            is_valid = False
            break

    if is_valid:
        result.append(name)

print(result)
